kcoelho-or/micropython/.history/lib/stm32lib/CMSIS/STM32F4xx/Include/stm32f407xx_20190917172033.h
/******************  Bit definition for FSMC_PCR4 register  *******************/
#define FSMC_PCR4_PWAITEN_Pos        (1U)
#define FSMC_PCR4_PWAITEN_Msk        (0x1U << FSMC_PCR4_PWAITEN_Pos)           /*!< 0x00000002 */
#define FSMC_PCR4_PWAITEN            FSMC_PCR4_PWAITEN_Msk                     /*!<Wait feature enable bit */
#define FSMC_PCR4_PBKEN_Pos          (2U)
#define FSMC_PCR4_PBKEN_Msk          (0x1U << FSMC_PCR4_PBKEN_Pos)             /*!< 0x00000004 */
#define FSMC_PCR4_PBKEN              FSMC_PCR4_PBKEN_Msk                       /*!<PC Card/NAND Flash memory bank enable bit */
#define FSMC_PCR4_PTYP_Pos           (3U)
#define FSMC_PCR4_PTYP_Msk           (0x1U << FSMC_PCR4_PTYP_Pos)              /*!< 0x00000008 */
#define FSMC_PCR4_PTYP               FSMC_PCR4_PTYP_Msk                        /*!<Memory type */

#define FSMC_PCR4_PWID_Pos           (4U)
#define FSMC_PCR4_PWID_Msk           (0x3U << FSMC_PCR4_PWID_Pos)              /*!< 0x00000030 */
#define FSMC_PCR4_PWID               FSMC_PCR4_PWID_Msk                        /*!<PWID[1:0] bits (NAND Flash databus width) */
#define FSMC_PCR4_PWID_0             (0x1U << FSMC_PCR4_PWID_Pos)              /*!< 0x00000010 */
#define FSMC_PCR4_PWID_1             (0x2U << FSMC_PCR4_PWID_Pos)              /*!< 0x00000020 */

#define FSMC_PCR4_ECCEN_Pos          (6U)
#define FSMC_PCR4_ECCEN_Msk          (0x1U << FSMC_PCR4_ECCEN_Pos)             /*!< 0x00000040 */
#define FSMC_PCR4_ECCEN              FSMC_PCR4_ECCEN_Msk                       /*!<ECC computation logic enable bit */

#define FSMC_PCR4_TCLR_Pos           (9U)
#define FSMC_PCR4_TCLR_Msk           (0xFU << FSMC_PCR4_TCLR_Pos)              /*!< 0x00001E00 */
#define FSMC_PCR4_TCLR               FSMC_PCR4_TCLR_Msk                        /*!<TCLR[3:0] bits (CLE to RE delay) */
#define FSMC_PCR4_TCLR_0             (0x1U << FSMC_PCR4_TCLR_Pos)              /*!< 0x00000200 */
#define FSMC_PCR4_TCLR_1             (0x2U << FSMC_PCR4_TCLR_Pos)              /*!< 0x00000400 */
#define FSMC_PCR4_TCLR_2             (0x4U << FSMC_PCR4_TCLR_Pos)              /*!< 0x00000800 */
#define FSMC_PCR4_TCLR_3             (0x8U << FSMC_PCR4_TCLR_Pos)              /*!< 0x00001000 */

#define FSMC_PCR4_TAR_Pos            (13U)
#define FSMC_PCR4_TAR_Msk            (0xFU << FSMC_PCR4_TAR_Pos)               /*!< 0x0001E000 */
#define FSMC_PCR4_TAR                FSMC_PCR4_TAR_Msk                         /*!<TAR[3:0] bits (ALE to RE delay) */
#define FSMC_PCR4_TAR_0              (0x1U << FSMC_PCR4_TAR_Pos)               /*!< 0x00002000 */
#define FSMC_PCR4_TAR_1              (0x2U << FSMC_PCR4_TAR_Pos)               /*!< 0x00004000 */
#define FSMC_PCR4_TAR_2              (0x4U << FSMC_PCR4_TAR_Pos)               /*!< 0x00008000 */
#define FSMC_PCR4_TAR_3              (0x8U << FSMC_PCR4_TAR_Pos)               /*!< 0x00010000 */

#define FSMC_PCR4_ECCPS_Pos          (17U)
#define FSMC_PCR4_ECCPS_Msk          (0x7U << FSMC_PCR4_ECCPS_Pos)             /*!< 0x000E0000 */
#define FSMC_PCR4_ECCPS              FSMC_PCR4_ECCPS_Msk                       /*!<ECCPS[2:0] bits (ECC page size) */
#define FSMC_PCR4_ECCPS_0            (0x1U << FSMC_PCR4_ECCPS_Pos)             /*!< 0x00020000 */
#define FSMC_PCR4_ECCPS_1            (0x2U << FSMC_PCR4_ECCPS_Pos)             /*!< 0x00040000 */
#define FSMC_PCR4_ECCPS_2            (0x4U << FSMC_PCR4_ECCPS_Pos)             /*!< 0x00080000 */

/*******************  Bit definition for FSMC_SR2 register  *******************/
#define FSMC_SR2_IRS_Pos             (0U)
#define FSMC_SR2_IRS_Msk             (0x1U << FSMC_SR2_IRS_Pos)                /*!< 0x00000001 */
#define FSMC_SR2_IRS                 FSMC_SR2_IRS_Msk                          /*!<Interrupt Rising Edge status                */
#define FSMC_SR2_ILS_Pos             (1U)
#define FSMC_SR2_ILS_Msk             (0x1U << FSMC_SR2_ILS_Pos)                /*!< 0x00000002 */
#define FSMC_SR2_ILS                 FSMC_SR2_ILS_Msk                          /*!<Interrupt Level status                      */
#define FSMC_SR2_IFS_Pos             (2U)
#define FSMC_SR2_IFS_Msk             (0x1U << FSMC_SR2_IFS_Pos)                /*!< 0x00000004 */
#define FSMC_SR2_IFS                 FSMC_SR2_IFS_Msk                          /*!<Interrupt Falling Edge status               */
#define FSMC_SR2_IREN_Pos            (3U)
#define FSMC_SR2_IREN_Msk            (0x1U << FSMC_SR2_IREN_Pos)               /*!< 0x00000008 */
#define FSMC_SR2_IREN                FSMC_SR2_IREN_Msk                         /*!<Interrupt Rising Edge detection Enable bit  */
#define FSMC_SR2_ILEN_Pos            (4U)
#define FSMC_SR2_ILEN_Msk            (0x1U << FSMC_SR2_ILEN_Pos)               /*!< 0x00000010 */
#define FSMC_SR2_ILEN                FSMC_SR2_ILEN_Msk                         /*!<Interrupt Level detection Enable bit        */
#define FSMC_SR2_IFEN_Pos            (5U)
#define FSMC_SR2_IFEN_Msk            (0x1U << FSMC_SR2_IFEN_Pos)               /*!< 0x00000020 */
#define FSMC_SR2_IFEN                FSMC_SR2_IFEN_Msk                         /*!<Interrupt Falling Edge detection Enable bit */
#define FSMC_SR2_FEMPT_Pos           (6U)
#define FSMC_SR2_FEMPT_Msk           (0x1U << FSMC_SR2_FEMPT_Pos)              /*!< 0x00000040 */
#define FSMC_SR2_FEMPT               FSMC_SR2_FEMPT_Msk                        /*!<FIFO empty */

/*******************  Bit definition for FSMC_SR3 register  *******************/
#define FSMC_SR3_IRS_Pos             (0U)
#define FSMC_SR3_IRS_Msk             (0x1U << FSMC_SR3_IRS_Pos)                /*!< 0x00000001 */
#define FSMC_SR3_IRS                 FSMC_SR3_IRS_Msk                          /*!<Interrupt Rising Edge status                */
#define FSMC_SR3_ILS_Pos             (1U)
#define FSMC_SR3_ILS_Msk             (0x1U << FSMC_SR3_ILS_Pos)                /*!< 0x00000002 */
#define FSMC_SR3_ILS                 FSMC_SR3_ILS_Msk                          /*!<Interrupt Level status                      */
#define FSMC_SR3_IFS_Pos             (2U)
#define FSMC_SR3_IFS_Msk             (0x1U << FSMC_SR3_IFS_Pos)                /*!< 0x00000004 */
#define FSMC_SR3_IFS                 FSMC_SR3_IFS_Msk                          /*!<Interrupt Falling Edge status               */
#define FSMC_SR3_IREN_Pos            (3U)
#define FSMC_SR3_IREN_Msk            (0x1U << FSMC_SR3_IREN_Pos)               /*!< 0x00000008 */
#define FSMC_SR3_IREN                FSMC_SR3_IREN_Msk                         /*!<Interrupt Rising Edge detection Enable bit  */
#define FSMC_SR3_ILEN_Pos            (4U)
#define FSMC_SR3_ILEN_Msk            (0x1U << FSMC_SR3_ILEN_Pos)               /*!< 0x00000010 */
#define FSMC_SR3_ILEN                FSMC_SR3_ILEN_Msk                         /*!<Interrupt Level detection Enable bit        */
#define FSMC_SR3_IFEN_Pos            (5U)
#define FSMC_SR3_IFEN_Msk            (0x1U << FSMC_SR3_IFEN_Pos)               /*!< 0x00000020 */
#define FSMC_SR3_IFEN                FSMC_SR3_IFEN_Msk                         /*!<Interrupt Falling Edge detection Enable bit */
#define FSMC_SR3_FEMPT_Pos           (6U)
#define FSMC_SR3_FEMPT_Msk           (0x1U << FSMC_SR3_FEMPT_Pos)              /*!< 0x00000040 */
#define FSMC_SR3_FEMPT               FSMC_SR3_FEMPT_Msk                        /*!<FIFO empty */

/*******************  Bit definition for FSMC_SR4 register  *******************/
#define FSMC_SR4_IRS_Pos             (0U)
#define FSMC_SR4_IRS_Msk             (0x1U << FSMC_SR4_IRS_Pos)                /*!< 0x00000001 */
#define FSMC_SR4_IRS                 FSMC_SR4_IRS_Msk                          /*!<Interrupt Rising Edge status                 */
#define FSMC_SR4_ILS_Pos             (1U)
#define FSMC_SR4_ILS_Msk             (0x1U << FSMC_SR4_ILS_Pos)                /*!< 0x00000002 */
#define FSMC_SR4_ILS                 FSMC_SR4_ILS_Msk                          /*!<Interrupt Level status                       */
#define FSMC_SR4_IFS_Pos             (2U)
#define FSMC_SR4_IFS_Msk             (0x1U << FSMC_SR4_IFS_Pos)                /*!< 0x00000004 */
#define FSMC_SR4_IFS                 FSMC_SR4_IFS_Msk                          /*!<Interrupt Falling Edge status                */
#define FSMC_SR4_IREN_Pos            (3U)
#define FSMC_SR4_IREN_Msk            (0x1U << FSMC_SR4_IREN_Pos)               /*!< 0x00000008 */
#define FSMC_SR4_IREN                FSMC_SR4_IREN_Msk                         /*!<Interrupt Rising Edge detection Enable bit   */
#define FSMC_SR4_ILEN_Pos            (4U)
#define FSMC_SR4_ILEN_Msk            (0x1U << FSMC_SR4_ILEN_Pos)               /*!< 0x00000010 */
#define FSMC_SR4_ILEN                FSMC_SR4_ILEN_Msk                         /*!<Interrupt Level detection Enable bit         */
#define FSMC_SR4_IFEN_Pos            (5U)
#define FSMC_SR4_IFEN_Msk            (0x1U << FSMC_SR4_IFEN_Pos)               /*!< 0x00000020 */
#define FSMC_SR4_IFEN                FSMC_SR4_IFEN_Msk                         /*!<Interrupt Falling Edge detection Enable bit  */
#define FSMC_SR4_FEMPT_Pos           (6U)
#define FSMC_SR4_FEMPT_Msk           (0x1U << FSMC_SR4_FEMPT_Pos)              /*!< 0x00000040 */
#define FSMC_SR4_FEMPT               FSMC_SR4_FEMPT_Msk                        /*!<FIFO empty */

/******************  Bit definition for FSMC_PMEM2 register  ******************/
#define FSMC_PMEM2_MEMSET2_Pos       (0U)
#define FSMC_PMEM2_MEMSET2_Msk       (0xFFU << FSMC_PMEM2_MEMSET2_Pos)         /*!< 0x000000FF */
#define FSMC_PMEM2_MEMSET2           FSMC_PMEM2_MEMSET2_Msk                    /*!<MEMSET2[7:0] bits (Common memory 2 setup time) */
#define FSMC_PMEM2_MEMSET2_0         (0x01U << FSMC_PMEM2_MEMSET2_Pos)         /*!< 0x00000001 */
#define FSMC_PMEM2_MEMSET2_1         (0x02U << FSMC_PMEM2_MEMSET2_Pos)         /*!< 0x00000002 */
#define FSMC_PMEM2_MEMSET2_2         (0x04U << FSMC_PMEM2_MEMSET2_Pos)         /*!< 0x00000004 */
#define FSMC_PMEM2_MEMSET2_3         (0x08U << FSMC_PMEM2_MEMSET2_Pos)         /*!< 0x00000008 */
#define FSMC_PMEM2_MEMSET2_4         (0x10U << FSMC_PMEM2_MEMSET2_Pos)         /*!< 0x00000010 */
#define FSMC_PMEM2_MEMSET2_5         (0x20U << FSMC_PMEM2_MEMSET2_Pos)         /*!< 0x00000020 */
#define FSMC_PMEM2_MEMSET2_6         (0x40U << FSMC_PMEM2_MEMSET2_Pos)         /*!< 0x00000040 */
#define FSMC_PMEM2_MEMSET2_7         (0x80U << FSMC_PMEM2_MEMSET2_Pos)         /*!< 0x00000080 */

#define FSMC_PMEM2_MEMWAIT2_Pos      (8U)
#define FSMC_PMEM2_MEMWAIT2_Msk      (0xFFU << FSMC_PMEM2_MEMWAIT2_Pos)        /*!< 0x0000FF00 */
#define FSMC_PMEM2_MEMWAIT2          FSMC_PMEM2_MEMWAIT2_Msk                   /*!<MEMWAIT2[7:0] bits (Common memory 2 wait time) */
#define FSMC_PMEM2_MEMWAIT2_0        (0x01U << FSMC_PMEM2_MEMWAIT2_Pos)        /*!< 0x00000100 */
#define FSMC_PMEM2_MEMWAIT2_1        (0x02U << FSMC_PMEM2_MEMWAIT2_Pos)        /*!< 0x00000200 */
#define FSMC_PMEM2_MEMWAIT2_2        (0x04U << FSMC_PMEM2_MEMWAIT2_Pos)        /*!< 0x00000400 */
#define FSMC_PMEM2_MEMWAIT2_3        (0x08U << FSMC_PMEM2_MEMWAIT2_Pos)        /*!< 0x00000800 */
#define FSMC_PMEM2_MEMWAIT2_4        (0x10U << FSMC_PMEM2_MEMWAIT2_Pos)        /*!< 0x00001000 */
#define FSMC_PMEM2_MEMWAIT2_5        (0x20U << FSMC_PMEM2_MEMWAIT2_Pos)        /*!< 0x00002000 */
#define FSMC_PMEM2_MEMWAIT2_6        (0x40U << FSMC_PMEM2_MEMWAIT2_Pos)        /*!< 0x00004000 */
#define FSMC_PMEM2_MEMWAIT2_7        (0x80U << FSMC_PMEM2_MEMWAIT2_Pos)        /*!< 0x00008000 */

#define FSMC_PMEM2_MEMHOLD2_Pos      (16U)
#define FSMC_PMEM2_MEMHOLD2_Msk      (0xFFU << FSMC_PMEM2_MEMHOLD2_Pos)        /*!< 0x00FF0000 */
#define FSMC_PMEM2_MEMHOLD2          FSMC_PMEM2_MEMHOLD2_Msk                   /*!<MEMHOLD2[7:0] bits (Common memory 2 hold time) */
#define FSMC_PMEM2_MEMHOLD2_0        (0x01U << FSMC_PMEM2_MEMHOLD2_Pos)        /*!< 0x00010000 */
#define FSMC_PMEM2_MEMHOLD2_1        (0x02U << FSMC_PMEM2_MEMHOLD2_Pos)        /*!< 0x00020000 */
#define FSMC_PMEM2_MEMHOLD2_2        (0x04U << FSMC_PMEM2_MEMHOLD2_Pos)        /*!< 0x00040000 */
#define FSMC_PMEM2_MEMHOLD2_3        (0x08U << FSMC_PMEM2_MEMHOLD2_Pos)        /*!< 0x00080000 */
#define FSMC_PMEM2_MEMHOLD2_4        (0x10U << FSMC_PMEM2_MEMHOLD2_Pos)        /*!< 0x00100000 */
#define FSMC_PMEM2_MEMHOLD2_5        (0x20U << FSMC_PMEM2_MEMHOLD2_Pos)        /*!< 0x00200000 */
#define FSMC_PMEM2_MEMHOLD2_6        (0x40U << FSMC_PMEM2_MEMHOLD2_Pos)        /*!< 0x00400000 */
#define FSMC_PMEM2_MEMHOLD2_7        (0x80U << FSMC_PMEM2_MEMHOLD2_Pos)        /*!< 0x00800000 */

